[{"attributes":{"title":"Ski Instructor at Caledon Ski Club","eventType":"job","date":"2014-12-01T00:00:00.000Z","thumbnail":"caledon","blurb":"I taught children how to ski – from their first time on skis to racing competitively in a team"},"body":""},{"attributes":{"title":"Director of Technology for the Concrete Rose Foundation","eventType":"ec","date":"2019-11-10T00:00:00.000Z","thumbnail":"crf","blurb":"I am creating a website for the Concrete Rose Foundation (CRF), a student-run non-profit organization founded at Queen’s University which provides access to education for those restricted by socioeconomic barriers.","tags":["svelte"]},"body":""},{"attributes":{"title":"Dodgeball: The Game","eventType":"project","date":"2018-01-01T00:00:00.000Z","thumbnailExt":"jpg","thumbnail":"dodgeball","repository":"https://github.com/casshoulding/dodgeballwiigameNEW","embed":"<iframe src=\"https://docs.google.com/presentation/d/e/2PACX-1vQ5WVy2lBOIX_RNUNP2MyYjy0ly-OMkrJUdsJQSeBwpispC888dcIcHa0QitigKCiwbix3n_yvAhQOM/embed?start=false&loop=false&delayms=3000\" frameborder=\"0\" width=\"480\" height=\"299\" allowfullscreen=\"true\" mozallowfullscreen=\"true\" webkitallowfullscreen=\"true\"></iframe>","blurb":"For Human-Computer Interaction, a course at Queen's, my group created a dodgeball game with motion tracking","tags":["unity3d"]},"body":"<p>For Human-Computer Interactions, a course at Queen&#39;s, my group created a dodgeball-style game where the player has to dodge objects approaching them. The goal of the game is to effectively avoid the dodgeballs, by moving left and right. The movement of the player is tracked through the infrared sensor within the Wii Remote. By using 2 IR lights taped onto either sides of a pair of sunglasses, the Wii Remote has the ability to pick up the IR light reflected from objects and track player movement.</p>\n<p>By using simple left and right movements, the player&#39;s physical movement is translated into movement for the in-game camera. The player will then either successfully dodge the balls, or experience a ‘hit’ resulting in a loss of 1 life. The game increases in difficulty the longer you play, and the score increases with time. If the player’s runs out of lives, it’s game over, and the player is given the option to play again. </p>\n"},{"attributes":{"title":"foldA Box Office System","eventType":"project","date":"2019-09-01T00:00:00.000Z","thumbnail":"folda","blurb":"foldA is a live digital performance festival based out of the Isabel Bader Centre in Kingston, Ontario. For my capstone project, I am helping to create an online system for selling tickets and getting audience metrics for foldA."},"body":""},{"attributes":{"title":"Homepage redesign","eventType":"project","date":"2019-11-01T00:00:00.000Z","thumbnail":"homepageThumb","blurb":"Using Svelte, a zero-runtime web framework, I redesigned my website with a timeline and dark mode","tags":["svelte"],"WIP":true},"body":""},{"attributes":{"title":"Counsellor at Camp Hurontario","eventType":"job","date":"2014-05-01T00:00:00.000Z","thumbnail":"hurontario","thumbnailExt":"jpg","blurb":"As a counsellor I worked with many different age groups from six to fourteen years old, and gained experience in working with people of different ability levels and interests."},"body":""},{"attributes":{"title":"IsEarthStillWarming.com","eventType":"project","date":"2019-01-11T00:00:00.000Z","website":"https://isearthstillwarming.com","repository":"https://github.com/rosslh/isearthstillwarming.com","image":"isearthstillwarming","thumbnail":"fire","blurb":"A website with up-to-date global warming information and data. It provides a high-level overview of what global warming is – how it's caused, how much the Earth has warmed, and its observed and predicted effects.","tags":["react"]},"body":"<p>The goal of this webpage is to provide a high-level overview of what global warming is: how it&#39;s caused, how much the Earth has warmed, and its observed and predicted effects. Made with <a href=\"https://github.com/nozzle/react-static\">React Static</a>, a static-site generator for React, IsEarthStillWarming.com fetches up-to-date climate data from NASA and NOAA servers and displays the data as charts to provide a visualization of how global warming is progressing.</p>\n<p>The webpage has a summary of the current state of global warming, with references provided for each piece of information. The website fetches its data and generates the webpages at build time, and on runtime it simply serves the already generated webpages. I chose this approach because retrieving and parsing the climate data takes some time. The servers we fetch data from are fairly slow, and the data comes in as a CSV which needs to be parsed into JSON in order to be used in a JavaScript application.</p>\n"},{"attributes":{"title":"Mandelbrot set explorer","eventType":"project","date":"2016-11-29T00:00:00.000Z","repository":"https://github.com/rosslh/Mandelbrot-set-explorer","image":"mandelbrot","thumbnail":"mandelbrot-thumb","blurb":"An interactive application that lets you explore the Mandelbrot set fractal. Made with Python and TKinter.","tags":["python"]},"body":"<p>The Mandelbrot Set is the set of complex numbers that stays bounded when iterated on the function, <code>f(z) = z<sup>2</sup> + c</code>. A famous example of a fractal in mathematics, the Mandelbrot Set has infinite complexity which makes exploring it quite interesting. In Python, using the UI and graphics libraries TKinter and Pillow, I created an interactive Mandelbrot Set visualizer that lets you zoom into parts of the fractal.</p>\n<p>One challenge with the Mandelbrot set is that it is quite computationally intensive to visualize. For each pixel in the visualization, those coordinates need to be iterated on the before-mentioned formula. In order to speed up the visualization, this project uses multiprocessing to split up the work load across all available CPU cores on the computer. Through this project I gained experience in software graphics and designing user interfaces.</p>\n"},{"attributes":{"title":"MetaProjection","eventType":"project","date":"2019-09-01T00:00:00.000Z","website":"https://www.metaprojection.ca","repository":"https://github.com/rosslh/metaprojection","image":"metaprojection","thumbnail":"metaprojection-thumb","blurb":"MetaProjection is a website that aggregates multiple Canadian federal electoral projections in order to provide an overview of how the election is playing out, both federally and by district.","tags":["gatsby","graphql"]},"body":"<p>MetaProjection is a website that aggregates multiple Canadian federal electoral projections in order to provide an overview of how the election is playing out, both federally and by district. A map is displayed at the top of the page which indicates how each electoral district is likely to vote. The application uses the user’s geolocation to find their district and display its likely winner.</p>\n<p>I made this project during the run-up to the 2019 Canadian federal election because I found myself checking multiple electoral projection sites that would sometimes have conflicting information. MetaProjection.ca gives a balanced overview of the election by combining the results of multiple reputable poll-trackers.</p>\n<p>MetaProjection was built with Gatsby, a React.js static site generator. First, the projection sources are scraped for their data, which is saved into json files. This data is then queried from the React client using GraphQL.</p>\n"},{"attributes":{"title":"CTO at MUSE Magazine","eventType":"ec","date":"2017-04-01T00:00:00.000Z","thumbnail":"muse","blurb":"I created a WordPress-based platform for publishing student-submitted articles, that reflects the design language of the physical MUSE magazine","tags":["wordpress"]},"body":""},{"attributes":{"title":"Front End Intern at Nudge.ai","eventType":"job","date":"2017-05-01T00:00:00.000Z","image":"Nudge1","thumbnail":"nudge-thumb","blurb":"I created a React.js admin interface for managing the Nudge platform","tags":["react","redux"]},"body":""},{"attributes":{"title":"Full Stack Intern at Nudge.ai","eventType":"job","date":"2018-05-01T00:00:00.000Z","image":"Nudge2","thumbnail":"nudge-thumb","blurb":"I implemented a system for receiving, verifying, and handling GDPR requests. I also added the capability for users to suggest changes to the information shown in our public pages with an intuitive interface.","tags":["react","net","postgres"]},"body":""},{"attributes":{"title":"QHacks","eventType":"ec","date":"2018-04-21T00:00:00.000Z","image":"qhacks","thumbnail":"qhacks-crown","website":"https://qhacks.io","repository":"https://github.com/qhacks/qhacks-website","blurb":"In my role on the QHacks executive team, I worked with a two other members of the exec to build the landing page for the hackathon as well as the interface students use to apply.","tags":["gatsby","graphql","postgres"]},"body":"<p><a href=\"https://qhacks.io\">QHacks</a> is a hackathon hosted at Queen’s University where software developers come together to collaborate on projects and win prizes. As part of the Technology team on the QHacks 2018/2019 Executive, my role was to help build a new website for the event that contains information on sponsors, the event schedule, and how to apply.</p>\n<p>I also build the front-end of our QHacks application dashboard - the webapp interested students used to apply to the event and give us more information about themselves. Over the month leading up the the event, the application system took in applications from over 1200 interested students - about 400 of which were accepted.</p>\n"},{"attributes":{"title":"QTMA","eventType":"ec","date":"2019-09-01T00:00:00.000Z","image":"studii","thumbnail":"qtma","blurb":"QTMA is a club at Queen's where three product teams develop a software application throughout the school year. This year I am working on one of those teams to build a web application for collaborative note taking.","tags":["react","django"]},"body":""},{"attributes":{"title":"Started at Queen's University","eventType":"other","date":"2016-09-01T00:00:00.000Z","thumbnail":"queens-thumb"},"body":""},{"attributes":{"title":"Graduated Queen's University","eventType":"other","date":"2020-05-01T00:00:00.000Z","thumbnail":"queens-thumb","WIP":true,"blurb":"Bachelor of Computing Honours"},"body":""},{"attributes":{"title":"Drawing robot","eventType":"project","date":"2018-09-01T00:00:00.000Z","thumbnailExt":"jpg","imageExt":"jpg","image":"robot","thumbnail":"arduino","blurb":"For Digital Systems, a course at Queen's, I made a drawing robot that listens to you and writes down what you say","tags":["arduino","rpi"]},"body":"<p>Our project is a voice enabled robotic car that writes down what you say to it. The AIY voice kit listens to what you say and parses the audio into text using Google Cloud Speech API. The Raspberry Pi takes the text and, using a Python script we’ve written, converts each character into a list of curves to be drawn. For each curve, the robot positions itself at the starting point using wheels connected to two stepper motors with L393D drivers. Stepper motors were chosen because they can be controlled more precisely than regular DC motors. Once in position, the servo lowers the marker to touch the paper. The robot then follows the curve until it reaches the endpoint.</p>\n"},{"attributes":{"title":"Unitransform","eventType":"project","date":"2018-12-05T00:00:00.000Z","repository":"https://github.com/rosslh/unitransform","website":"https://www.npmjs.com/package/unitransform","image":"unitransform","thumbnail":"rainbow","WIP":true,"blurb":"A JavaScript library for visually consistent color transformations through HSLuv color space"},"body":"<p>Unitransform is a JavaScript library for visually consistent color transformations through HSLuv color space. For example, with this library you can saturate or lighten multiple colors and all colors will look like they changed by the same amount.</p>\n"},{"attributes":{"title":"Intern at Verafin","eventType":"job","date":"2019-05-01T00:00:00.000Z","thumbnail":"verafin-thumb","image":"verafin","blurb":"I made multiple upgrades and bug fixes to the user interface that were requested by Verafin clients. I created a Verafin plugin that identifies high risk customers based on transaction and biographical characteristics.","tags":["java","postgres","backbone"]},"body":""},{"attributes":{"title":"WTFormat.com","eventType":"project","date":"2018-12-05T00:00:00.000Z","repository":"https://github.com/rosslh/wtformat","website":"https://wtformat.com/","image":"wtformat","thumbnail":"moment","blurb":"An online tool for generating Moment.js date format codes","tags":["javascript"]},"body":"<p><a href=\"https://momentjs.com\">Moment.js</a> is a JavaScript library that can parse, manipulate, and format dates and times. To format a date, you give Moment a time code like <code>YYYY-MM-DD</code>. When I was working front-end at <a href=\"https://www.nudge.ai\">Nudge.ai</a></a>, I found myself having to go to Moment&#39;s documentation to see how to format dates in various ways.</p>\n<p>In order to make the process of date formatting faster, I created <a href=\"https://wtformat.com\">WTFormat.com</a>, which gives you a date which you rewite in your preferred format. The site then generates the Moment format code that would yield that output.</p>\n"}]